{
    "account": [
        {
            "username": "user1@gmail.com",
            "password": "password1",
            "active": true,
            "fullName": "John Doe",
            "address": "123 Street, City",

            "age": 30,
            "salary": 50000,
            "type_account": "shipper"
        },
        {
            "username": "user2@gmail.com",
            "password": "password2",
            "active": true,
            "fullName": "Jane Smith",
            "address": "456 Avenue, Town",

            "age": 35,
            "salary": 60000,
            "type_account": "shipper"
        },
        {
            "username": "user3@gmail.com",
            "password": "password3",
            "active": true,
            "fullName": "Robert Johnson",
            "address": "789 Road, Village",

            "age": 28,
            "salary": 45000,
            "type_account": "shipper"
        },
        {
            "username": "user4@gmail.com",
            "password": "password4",
            "active": true,
            "fullName": "Sarah Davis",
            "address": "321 Lane, County",

            "age": 32,
            "salary": 55000,
            "type_account": "shipper"
        },
        {
            "username": "user5@gmail.com",
            "password": "password5",
            "active": true,
            "fullName": "Michael Wilson",
            "address": "654 Court, State",

            "age": 40,
            "salary": 70000,
            "type_account": "shipper"
        },
        {
            "username": "user6@gmail.com",
            "password": "password6",
            "active": true,
            "fullName": "Emily Anderson",
            "address": "987 Drive, Country",

            "age": 26,
            "salary": 40000,
            "type_account": "customer"
        },
        {
            "username": "user7@gmail.com",
            "password": "password7",
            "active": true,
            "fullName": "Christopher Thompson",
            "address": "135 Boulevard, Town",

            "age": 31,
            "salary": 55000,
            "type_account": "customer"
        },
        {
            "username": "user8@gmail.com",
            "password": "password8",
            "active": true,
            "fullName": "Olivia Martinez",
            "address": "864 Place, City",

            "age": 29,
            "salary": 48000,
            "type_account": "customer"
        },
        {
            "username": "user9@gmail.com",
            "password": "password9",
            "active": true,
            "fullName": "Daniel Johnson",
            "address": "753 Way, Village",

            "age": 33,
            "salary": 60000,
            "type_account": "customer"
        },
        {
            "username": "user20",
            "password": "password10",
            "active": true,
            "fullName": "Sophia Brown",
            "address": "246 Road, County",

            "age": 27,
            "salary": 42000,
            "type_account": "customer"
        }
    ],
    "order": [
        {
            "id_user": 1,
            "order_date": "2022-01-15",
            "total_amount": 100.0,
            "shipping_address": "123 Street, City",
            "status": "pending",
            "weight": 2.5,
            "shipping_cost": 10.0
        },
        {
            "id_user": 1,
            "order_date": "2022-02-10",
            "total_amount": 50.0,
            "shipping_address": "123 Street, City",
            "status": "completed",
            "weight": 1.5,
            "shipping_cost": 7.0
        },
        {
            "id_user": 2,
            "order_date": "2022-03-20",
            "total_amount": 75.0,
            "shipping_address": "456 Avenue, Town",
            "status": "shipped",
            "weight": 3.0,
            "shipping_cost": 12.0
        },
        {
            "id_user": 2,
            "order_date": "2022-04-05",
            "total_amount": 200.0,
            "shipping_address": "456 Avenue, Town",
            "status": "pending",
            "weight": 5.0,
            "shipping_cost": 15.0
        },
        {
            "id_user": 3,
            "order_date": "2022-05-10",
            "total_amount": 150.0,
            "shipping_address": "789 Road, Village",
            "status": "completed",
            "weight": 4.0,
            "shipping_cost": 10.0
        },
        {
            "id_user": 3,
            "order_date": "2022-06-25",
            "total_amount": 80.0,
            "shipping_address": "789 Road, Village",
            "status": "shipped",
            "weight": 2.0,
            "shipping_cost": 8.5
        },
        {
            "id_user": 4,
            "order_date": "2022-07-05",
            "total_amount": 60.0,
            "shipping_address": "321 Lane, County",
            "status": "completed",
            "weight": 1.5,
            "shipping_cost": 7.0
        },
        {
            "id_user": 4,
            "order_date": "2022-08-15",
            "total_amount": 120.0,
            "shipping_address": "321 Lane, County",
            "status": "pending",
            "weight": 3.0,
            "shipping_cost": 10.0
        },
        {
            "id_user": 5,
            "order_date": "2022-09-02",
            "total_amount": 90.0,
            "shipping_address": "654 Court, State",
            "status": "shipped",
            "weight": 2.5,
            "shipping_cost": 9.0
        },
        {
            "id_user": 5,
            "order_date": "2022-10-12",
            "total_amount": 180.0,
            "shipping_address": "654 Court, State",
            "status": "completed",
            "weight": 5.0,
            "shipping_cost": 15.0
        },
        {
            "id_user": 6,
            "order_date": "2022-11-05",
            "total_amount": 70.0,
            "shipping_address": "987 Drive, Country",
            "status": "pending",
            "weight": 2.0,
            "shipping_cost": 8.0
        },
        {
            "id_user": 6,
            "order_date": "2022-12-20",
            "total_amount": 130.0,
            "shipping_address": "987 Drive, Country",
            "status": "completed",
            "weight": 3.5,
            "shipping_cost": 11.0
        },
        {
            "id_user": 7,
            "order_date": "2023-01-10",
            "total_amount": 110.0,
            "shipping_address": "135 Boulevard, Town",
            "status": "shipped",
            "weight": 3.0,
            "shipping_cost": 10.0
        },
        {
            "id_user": 7,
            "order_date": "2023-02-05",
            "total_amount": 40.0,
            "shipping_address": "135 Boulevard, Town",
            "status": "pending",
            "weight": 1.0,
            "shipping_cost": 6.0
        },
        {
            "id_user": 8,
            "order_date": "2023-03-18",
            "total_amount": 95.0,
            "shipping_address": "864 Place, City",
            "status": "completed",
            "weight": 2.5,
            "shipping_cost": 9.5
        },
        {
            "id_user": 8,
            "order_date": "2023-04-01",
            "total_amount": 200.0,
            "shipping_address": "864 Place, City",
            "status": "shipped",
            "weight": 5.0,
            "shipping_cost": 15.0
        },
        {
            "id_user": 9,
            "order_date": "2023-05-05",
            "total_amount": 75.0,
            "shipping_address": "753 Way, Village",
            "status": "pending",
            "weight": 2.0,
            "shipping_cost": 8.0
        },
        {
            "id_user": 9,
            "order_date": "2023-06-10",
            "total_amount": 160.0,
            "shipping_address": "753 Way, Village",
            "status": "completed",
            "weight": 4.0,
            "shipping_cost": 12.0
        },
        {
            "id_user": 10,
            "order_date": "2023-07-15",
            "total_amount": 55.0,
            "shipping_address": "246 Road, County",
            "status": "shipped",
            "weight": 1.5,
            "shipping_cost": 7.0
        },
        {
            "id_user": 10,
            "order_date": "2023-08-20",
            "total_amount": 180.0,
            "shipping_address": "246 Road, County",
            "status": "completed",
            "weight": 5.0,
            "shipping_cost": 15.0
        }
    ],
    "product": [
        {
            "name": "Pink Princess Cake",
            "detail": "Pink Princess Cake is a delicious and visually stunning dessert that is often served at special occasions such as birthdays and weddings. This cake typically consists of several layers of moist, vanilla sponge cake that are filled with layers of light and fluffy whipped cream and sliced fresh strawberries.  What sets Pink Princess Cake apart from other cakes is its unique appearance. The cake is covered in a layer of bright pink marzipan or fondant, which is then decorated with intricate designs and patterns made from white icing or frosting. These decorations often include delicate flowers, lace-like patterns, and even small crowns or tiaras, giving the cake a regal and elegant look that is sure to impress.  Pink Princess Cake is believed to have originated in Sweden, where it is known as \"Prinsesstårta\". It has since become a popular dessert in many countries around the world, particularly in Scandinavia, where it is often served during celebrations such as Midsummer and Christmas.  Whether you're looking to impress guests at a special event or simply want to indulge in a delicious and visually stunning dessert, Pink Princess Cake is a wonderful choice that is sure to delight. The marzipan or fondant that covers the Pink Princess Cake is often flavored with almond extract, giving it a subtle nutty taste that complements the cake's other flavors.  In addition to vanilla sponge cake, some variations of Pink Princess Cake may use other types of cake such as chocolate or lemon.  Pink Princess Cake is traditionally served chilled, which helps to keep the whipped cream filling firm and the cake layers moist.  Because of its intricate decoration and delicate flavors, Pink Princess Cake is considered a high-end dessert and is often priced accordingly at bakeries and cafes.  If you're feeling ambitious, you can try making Pink Princess Cake at home using a recipe that includes step-by-step instructions for creating the cake layers, whipped cream filling, and decorative covering.",
            "quantity": 33,
            "price": 50000,
            "sold": 10,
            "inventory": 90,
            "type": "cake",
            "weight" : 0.5,
            "images": "https://nguyenvancuong1ty.github.io/intern_cake/img/cake0.webp"
        },
        {
            "name": "Chocolate Layer Cake",
            "detail": "Chocolate Layer Cake is a rich and decadent dessert that is beloved by chocolate lovers all around the world. As its name suggests, this cake consists of several layers of moist chocolate cake that are separated by layers of creamy chocolate frosting or ganache.  The cake itself is typically made using ingredients such as cocoa powder, flour, sugar, eggs, and butter, which are mixed together and baked in round cake pans. Once the cakes have cooled, they are stacked on top of each other and layered with frosting, which can be made using a variety of ingredients such as butter, powdered sugar, cream, and melted chocolate.  Chocolate Layer Cake is a classic dessert that has been enjoyed for generations. It is often served at birthday parties, weddings, and other special occasions, and can be decorated with a variety of toppings and decorations such as fresh fruit, whipped cream, chocolate shavings, or even edible flowers.  Variations of Chocolate Layer Cake can include different types of chocolate such as dark chocolate, milk chocolate, or white chocolate, as well as different types of fillings such as raspberry jam, caramel sauce, or peanut butter frosting. Some recipes also incorporate other flavors such as coffee, orange, or mint to add depth and complexity to the chocolate flavor.  If you're looking to make Chocolate Layer Cake at home, there are many recipes available online that offer step-by-step instructions for making the cake layers, frosting, and decorations. With a little practice and patience, you can create a delicious and impressive Chocolate Layer Cake that is sure to delight your friends and family.",
            "quantity": 33,
            "price": 45000,
            "sold": 20,
            "inventory": 80,
            "type": "cake",
            "weight" : 1.1,
            "images": "https://nguyenvancuong1ty.github.io/intern_cake/img/cake1.webp"
        },
        {
            "name": "Vanilla Birthday Cake",
            "detail": "Vanilla Birthday Cake is a classic dessert that is often served at birthday parties and other celebratory events. This cake is characterized by its light and fluffy texture, delicate vanilla flavor, and festive decorations.  The cake itself is typically made using ingredients such as flour, sugar, eggs, butter, and vanilla extract. These ingredients are mixed together to create a smooth batter that is then baked in round cake pans. Once the cakes have cooled, they are layered with frosting or buttercream, which can be flavored with additional vanilla extract or other ingredients such as chocolate, fruit, or nuts.  Vanilla Birthday Cake is often decorated with colorful frosting or icing, which can be piped onto the cake in a variety of shapes and designs. Common decorations include swirls, dots, stars, and other festive shapes. The cake may also be topped with sprinkles, candy, or other edible decorations.  While Vanilla Birthday Cake is a simple dessert, it is beloved by many for its comforting and nostalgic flavor. It is often associated with childhood memories and is a popular choice for both children and adults.  If you're looking to make Vanilla Birthday Cake at home, there are many recipes available online that offer step-by-step instructions for making the cake layers, frosting, and decorations. With a little practice and creativity, you can create a delicious and visually appealing cake that is sure to make any birthday celebration extra special.",
            "quantity": 33,
            "price": 40000,
            "sold": 15,
            "inventory": 85,
            "type": "cake",
            "weight" : 0.7,
            "images": "https://nguyenvancuong1ty.github.io/intern_cake/img/cake6.webp"
        },
        {
            "name": "Classic White Wedding Cake",
            "detail": "The Classic White Wedding Cake is a traditional dessert that is often served at weddings and other formal events. This cake is characterized by its light and fluffy texture, delicate flavor, and elegant decorations.  The cake itself is typically made using ingredients such as flour, sugar, eggs, butter, and vanilla extract. These ingredients are mixed together to create a smooth batter that is then baked in round cake pans. The cakes are then stacked on top of each other, separated by layers of creamy white frosting or buttercream.  The frosting used on the Classic White Wedding Cake is often made using a mixture of butter, powdered sugar, and cream, which creates a smooth and creamy texture that complements the delicate flavor of the cake. The cake may also be decorated with intricate designs and patterns made from white icing or frosting, creating a sophisticated and timeless look that is perfect for a wedding or other formal event.  While the Classic White Wedding Cake is a traditional dessert, there are many variations and flavors that can be incorporated into the recipe. Some cakes may include additional ingredients such as almond extract or lemon zest, while others may be filled with fresh fruit or other types of frosting such as chocolate or raspberry.  If you're looking to make a Classic White Wedding Cake at home, there are many recipes available online that offer step-by-step instructions for making the cake layers, frosting, and decorations. With a little practice and patience, you can create a beautiful and delicious cake that is sure to impress your guests on your special day.",
            "quantity": 33,
            "price": 200000,
            "sold": 5,
            "inventory": 15,
            "type": "cake",
            "weight" : 1.15,
            "images": "https://nguyenvancuong1ty.github.io/intern_cake/img/cake3.webp"
        },
        {
            "name": "Elegant Lace Wedding Cake",
            "detail": "The Elegant Lace Wedding Cake is a beautiful and intricate dessert that is often served at weddings and other formal events. This cake is characterized by its delicate lace-like design, elegant appearance, and rich, moist texture.  The cake itself is typically made using ingredients such as flour, sugar, eggs, and butter, which are mixed together to create a smooth batter that is then baked in round cake pans. Once the cakes have cooled, they are stacked on top of each other and layered with a rich, buttery frosting or buttercream.  The lace-like design that gives the Elegant Lace Wedding Cake its signature look is typically created using a special technique called piping. This involves using a piping bag and a small round tip to create intricate swirls and patterns on the cake's surface. The patterns may be inspired by traditional lace designs, or they may be customized to reflect the couple's unique style and personality.  The Elegant Lace Wedding Cake is a classic and timeless dessert that is sure to impress guests with its beauty and sophistication. It is often served at formal events and is a popular choice for couples who are looking for a wedding cake that is both elegant and unique.  If you're looking to make an Elegant Lace Wedding Cake at home, there are many recipes and tutorials available online that can guide you through the process of creating this stunning dessert. With a little practice and patience, you can create a beautiful and delicious cake that is sure to be a highlight of your special day.",
            "quantity": 33,
            "price": 250000,
            "sold": 2,
            "inventory": 18,
            "type": "cake",
            "weight" : 0.62,
            "images": "https://nguyenvancuong1ty.github.io/intern_cake/img/cake6.webp"
        },
        {
            "name": "Rustic Buttercream Wedding Cake",
            "detail": "The Rustic Buttercream Wedding Cake is a simple yet elegant dessert that is often served at weddings and other rustic-themed events. This cake is characterized by its natural, textured appearance and rich, buttery flavor.  The cake itself is typically made using ingredients such as flour, sugar, eggs, and butter, which are mixed together to create a smooth batter that is then baked in round cake pans. Once the cakes have cooled, they are stacked on top of each other and layered with a generous coating of buttercream frosting.  The frosting used on the Rustic Buttercream Wedding Cake is typically textured and rustic in appearance, with visible swirls and peaks that create a natural, organic look. The cake may also be decorated with fresh flowers, berries, or other natural elements that reflect the rustic theme of the event.  The Rustic Buttercream Wedding Cake is a popular choice for couples who are looking for a simple yet elegant dessert that is both delicious and visually appealing. It is often served at outdoor weddings, barn weddings, and other events that embrace a rustic or natural aesthetic.  If you're looking to make a Rustic Buttercream Wedding Cake at home, there are many recipes and tutorials available online that can guide you through the process of creating this beautiful dessert. With a little creativity and a few simple techniques, you can create a stunning cake that is sure to impress your guests and add a touch of rustic charm to your special day.",
            "quantity": 33,
            "price": 175000,
            "sold": 8,
            "inventory": 22,
            "type": "cake",
            "weight" : 0.11,
            "images": "https://nguyenvancuong1ty.github.io/intern_cake/img/banh.webp"
        },
        {
            "name": "Gold Anniversary Cake",
            "detail": "The Gold Anniversary Cake is a special dessert that is often served to celebrate a couple's 50th wedding anniversary. This cake is characterized by its elegant gold decorations, which symbolize the couple's enduring love and commitment to each other.  The cake itself is typically made using ingredients such as flour, sugar, eggs, and butter, which are mixed together to create a smooth batter that is then baked in round cake pans. Once the cakes have cooled, they are stacked on top of each other and layered with a rich, buttery frosting.  The gold decorations that give the Gold Anniversary Cake its signature look are typically created using edible gold leaf, which is a thin sheet of gold that is applied to the surface of the cake using a special technique. The gold leaf may be used to create intricate designs and patterns on the cake's surface, or it may be applied in a more subtle way to create a shimmering, golden sheen.  The Gold Anniversary Cake is a beautiful and meaningful dessert that is often served at 50th wedding anniversary celebrations. It is a tribute to the couple's enduring love and commitment to each other, and is a fitting way to mark this important milestone in their lives.  If you're looking to make a Gold Anniversary Cake at home, there are many recipes and tutorials available online that can guide you through the process of creating this stunning dessert. With a little patience and a steady hand, you can create a beautiful and delicious cake that is sure to be a highlight of your anniversary celebration.",
            "quantity": 33,
            "price": 100000,
            "sold": 3,
            "inventory": 12,
            "type": "cake",
            "weight" : 1.1,
            "images": "https://nguyenvancuong1ty.github.io/intern_cake/img/banh1.webp"
        },
        {
            "name": "Diamond Anniversary Cake",
            "detail": "The Diamond Anniversary Cake is a special dessert that is often served to celebrate a couple's 60th wedding anniversary. This cake is characterized by its elegant diamond decorations, which symbolize the strength and resilience of the couple's relationship over the past six decades.  The cake itself is typically made using ingredients such as flour, sugar, eggs, and butter, which are mixed together to create a smooth batter that is then baked in round cake pans. Once the cakes have cooled, they are stacked on top of each other and layered with a rich, buttery frosting.  The diamond decorations that give the Diamond Anniversary Cake its signature look are typically created using edible diamond-shaped jewels, which are made from sugar or fondant and applied to the surface of the cake using a special technique. The jewels may be arranged in intricate patterns and designs, or they may be used sparingly to create a subtle yet elegant effect.  The Diamond Anniversary Cake is a beautiful and meaningful dessert that is often served at 60th wedding anniversary celebrations. It is a tribute to the couple's enduring love and commitment to each other, and is a fitting way to mark this important milestone in their lives.  If you're looking to make a Diamond Anniversary Cake at home, there are many recipes and tutorials available online that can guide you through the process of creating this stunning dessert. With a little creativity and attention to detail, you can create a beautiful and delicious cake that is sure to be a highlight of your anniversary celebration.",
            "quantity": 33,
            "price": 150000,
            "sold": 2,
            "inventory": 10,
            "type": "cake",
            "weight" : 1.2,
            "images": "https://nguyenvancuong1ty.github.io/intern_cake/img/banh2.webp"
        },
        {
            "name": "Red Velvet Anniversary Cake",
            "detail": "The Red Velvet Anniversary Cake is a special dessert that is often served to celebrate a couple's milestone wedding anniversary. This cake is characterized by its rich, velvety texture and deep red color, which symbolizes the passion and love that the couple shares.  The cake itself is typically made using ingredients such as flour, cocoa powder, buttermilk, and red food coloring, which are mixed together to create a smooth batter that is then baked in round cake pans. Once the cakes have cooled, they are stacked on top of each other and layered with a creamy, tangy frosting made from cream cheese and butter.  The Red Velvet Anniversary Cake is a popular choice for couples who are celebrating a milestone anniversary, such as their 25th or 50th year together. It is a tribute to the enduring love and commitment that the couple shares, and is a fitting way to mark this important milestone in their lives.  If you're looking to make a Red Velvet Anniversary Cake at home, there are many recipes and tutorials available online that can guide you through the process of creating this delicious and visually stunning dessert. With a little creativity and attention to detail, you can create a beautiful and memorable cake that is sure to be a hit with your guests and loved ones.",
            "quantity": 33,
            "price": 120000,
            "sold": 4,
            "inventory": 18,
            "type": "cake",
            "weight" : 1.5,
            "images": "https://nguyenvancuong1ty.github.io/intern_cake/img/banh3.webp"
        },
        {
            "name": "Halloween Cake",
            "detail": "The Halloween Cake is a fun and festive dessert that is often served during the Halloween season. This cake is characterized by its spooky decorations and playful designs, which can include anything from creepy crawlies to witches and ghosts.  The cake itself is typically made using ingredients such as flour, sugar, eggs, and butter, which are mixed together to create a smooth batter that is then baked in a cake pan. Once the cake has cooled, it can be frosted with a variety of different flavors and colors, depending on the desired effect.  Some popular Halloween Cake decorations include black and orange frosting, candy corn, spiderwebs made from frosting, edible eyeballs, and spooky cake toppers such as plastic spiders, skeletons, and bats. The cake can also be shaped into fun Halloween-themed designs, such as a pumpkin or a witch's hat.  The Halloween Cake is a perfect dessert for Halloween parties, potlucks, or other festive gatherings. It is a fun and creative way to celebrate the season and indulge in some sweet treats.  If you're looking to make a Halloween Cake at home, there are many recipes and tutorials available online that can guide you through the process of creating this playful and delicious dessert. With a little imagination and creativity, you can create a cake that is sure to be a hit with your friends and family.",
            "quantity": 33,
            "price": 60000,
            "sold": 12,
            "inventory": 28,
            "type": "cake",
            "weight" : 0.57,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/halo-removebg-preview.png"
        },
        {
            "name": "Thanksgiving Cake",
            "detail": "The Thanksgiving Cake is a delicious and festive dessert that is often served as part of a Thanksgiving meal. This cake is characterized by its warm, comforting flavors, which are perfect for the autumn season.  The cake itself is typically made using ingredients such as flour, sugar, eggs, and butter, which are mixed together to create a smooth batter that is then baked in a cake pan. Once the cake has cooled, it can be frosted with a variety of different flavors and colors, depending on the desired effect.  Some popular Thanksgiving Cake flavors include pumpkin spice, apple cinnamon, and maple pecan. The cake can also be decorated with autumn-themed designs, such as leaves, acorns, and pumpkins, which can be made from frosting, fondant, or other edible materials.  The Thanksgiving Cake is a perfect dessert to serve at a Thanksgiving gathering or dinner party. It is a great way to cap off a delicious meal and celebrate the spirit of the holiday.  If you're looking to make a Thanksgiving Cake at home, there are many recipes and tutorials available online that can guide you through the process of creating this delicious and festive dessert. With a little creativity and imagination, you can create a cake that is sure to be a hit with your friends and family.",
            "quantity": 33,
            "price": 70000,
            "sold": 8,
            "inventory": 25,
            "type": "cake",
            "weight" : 0.7,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/thankcake-removebg-preview.png"
        },
        {
            "name": "Christmas Cake",
            "detail": "The Christmas Cake is a traditional dessert that is often served during the Christmas holiday season. This cake is characterized by its rich, fruity flavor and festive decorations, which can include everything from colorful icing to edible ornaments.  The cake itself is typically made using ingredients such as flour, sugar, eggs, and dried fruits such as raisins, currants, and candied peel. These ingredients are mixed together to create a rich, dense cake batter that is then baked in a cake pan. Once the cake has cooled, it can be soaked in brandy or other spirits to enhance its flavor and moistness.  Some popular Christmas Cake decorations include icing in the shape of snowflakes or Christmas trees, marzipan figurines, and edible glitter or sprinkles. The cake can also be decorated with nuts, berries, and other seasonal fruits to add a festive touch.  The Christmas Cake is a classic dessert that is enjoyed by people all over the world during the holiday season. It is often served as part of a Christmas dinner or as a sweet treat to enjoy with family and friends.  If you're looking to make a Christmas Cake at home, there are many recipes and tutorials available online that can guide you through the process of creating this delicious and festive dessert. With a little practice and patience, you can create a beautiful and memorable cake that is sure to delight your loved ones this holiday season.",
            "quantity": 33,
            "price": 80000,
            "sold": 10,
            "inventory": 20,
            "type": "cake",
            "weight" : 0.8,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/noel-removebg-preview.png"
        },
        {
            "name": "Gender Reveal Cake",
            "detail": "The Gender Reveal Cake is a fun and creative way for expecting parents to announce the gender of their baby to family and friends. This cake is typically designed to reveal the gender of the baby through the color of its interior frosting or cake batter.  The cake itself is typically made using ingredients such as flour, sugar, eggs, and butter, which are mixed together to create a smooth batter that is then baked in a cake pan. Once the cake has cooled, it is typically frosted in a neutral color such as white or yellow.  The interior of the cake is where the gender reveal comes in. This can be accomplished by either tinting the cake batter or frosting with blue or pink food coloring, or by adding a layer of blue or pink frosting in between the cake layers.  To reveal the gender of the baby, the expecting parents will cut into the cake to reveal the interior color, which will either be blue for a boy or pink for a girl. This is often a surprise not only for family and friends but also for the expecting parents themselves!  Gender Reveal Cakes have become increasingly popular in recent years as a way to celebrate the upcoming arrival of a new baby. There are many different variations and designs to choose from, including cakes decorated with baby toys, rattles, or other baby-themed designs.  If you're looking to make a Gender Reveal Cake at home, there are many recipes and tutorials available online that can guide you through the process of creating this fun and creative dessert. With a little creativity and imagination, you can create a cake that is sure to surprise and delight your guests.",
            "quantity": 33,
            "price": 90000,
            "sold": 6,
            "inventory": 16,
            "type": "cake",
            "weight" : 0.88,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/v-removebg-preview.png"
        },
        {
            "name": "Graduation Cake",
            "detail": "The Graduation Cake is a celebratory dessert that is often served at graduation parties and ceremonies to mark the achievement of completing a degree or program of study. This cake is typically designed to reflect the graduate's school colors, personal interests, and future aspirations.  The cake itself is typically made using ingredients such as flour, sugar, eggs, and butter, which are mixed together to create a smooth batter that is then baked in a cake pan. Once the cake has cooled, it can be frosted with a variety of different flavors and colors, depending on the desired effect.  Some popular Graduation Cake designs include cakes decorated with graduation caps, diplomas, or school mascots. The cake can also be decorated with the graduate's name, graduation year, and any personal messages or well wishes.  The Graduation Cake is a perfect dessert to serve at a graduation party or ceremony. It is a great way to recognize the achievements of the graduate and celebrate their future success.  If you're looking to make a Graduation Cake at home, there are many recipes and tutorials available online that can guide you through the process of creating this celebratory dessert. With a little creativity and imagination, you can create a cake that is sure to be a hit with the graduate and their guests.",
            "quantity": 33,
            "price": 100000,
            "sold": 5,
            "inventory": 15,
            "type": "cake",
            "weight" : 0.45,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/a-removebg-preview.png"
        },
        {
            "name": "Custom Flower Cake",
            "detail": "A Custom Flower Cake is a beautiful and artistic dessert that is typically made to celebrate special occasions such as weddings, birthdays, and anniversaries. This cake is designed to showcase the beauty and elegance of fresh flowers, which are used to decorate the cake in a variety of different ways.  The cake itself is typically made using ingredients such as flour, sugar, eggs, and butter, which are mixed together to create a smooth batter that is then baked in a cake pan. Once the cake has cooled, it is often layered and frosted with a variety of different flavors and colors.  The flowers used to decorate the Custom Flower Cake can be fresh or artificial, depending on personal preference and availability. Fresh flowers such as roses, peonies, and dahlias are often used to create stunning floral arrangements that cascade down the sides of the cake or form a beautiful bouquet on top. Artificial flowers such as silk or paper flowers can also be used to create a long-lasting and durable decoration that can be saved as a keepsake.  Custom Flower Cakes can be designed in a variety of different styles, from elegant and minimalist to bold and colorful. The cake can be decorated with a single type of flower or a combination of different flowers, depending on the desired effect. The colors and textures of the flowers can also be used to complement the overall theme and style of the event.  If you're looking to make a Custom Flower Cake at home, there are many recipes and tutorials available online that can guide you through the process of creating this beautiful and artistic dessert. With a little creativity and imagination, you can create a cake that is sure to be a showstopper at any special occasion.",
            "quantity": 33,
            "price": 150000,
            "sold": 2,
            "inventory": 10,
            "type": "cake",
            "weight" : 0.35,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/aa.png"
        },
        {
            "name": "Mediocre Granite Plate",
            "detail": "A Mediocre Granite Plate is not a specific type of dessert or food item, but rather a description of a serving plate that is made from granite and considered to be average or unremarkable in quality or appearance.  Granite is a popular material for serving plates due to its durability, heat resistance, and natural beauty. However, not all granite plates are created equal, and some may be of lower quality or less visually appealing than others.  A Mediocre Granite Plate may be characterized by its lack of unique or interesting features, such as unusual patterns or color variations. It may also have visible imperfections or blemishes, such as chips or scratches, that detract from its overall aesthetic appeal.  Despite its mediocre appearance, a Granite Plate can still be a useful and functional item for serving desserts or other food items. It can be used to showcase a variety of different desserts, such as cakes, pies, or pastries, and can be paired with complementary tableware to create an attractive and cohesive presentation.  If you're looking to purchase a Granite Plate for serving desserts or other food items, it's important to do your research and choose a high-quality plate that meets your needs and preferences. Look for plates that are made from high-quality granite, are free from visible imperfections, and have unique and interesting features that add to their overall beauty and appeal.",
            "quantity": 33,
            "price": 200000,
            "sold": 50,
            "inventory": 49,
            "type": "cake",
            "weight" : 1.35,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/vlt1.webp"
        },
        {
            "name": "Heavy Duty Paper Car",
            "detail": "A Heavy Duty Paper Car is not a specific type of dessert or food item, but rather a description of a toy car that is made from heavy-duty paper and designed to be sturdy and durable. This type of toy car is often used as a decorative item or party favor at children's birthday parties, baby showers, or other special events.  Heavy Duty Paper Cars are typically made using high-quality paper that is thick and durable, allowing the car to withstand wear and tear from rough handling or play. The paper is often coated or laminated to provide added strength and protection, and the car may be designed with reinforced seams or other features to prevent tearing or damage.  These paper cars come in a variety of different shapes and designs, from classic sports cars and vintage vehicles to modern trucks and race cars. They can be customized with different colors, patterns, and graphics to match the theme or color scheme of the event, and may be decorated with stickers, markers, or other craft supplies to make them even more unique and personalized.  Heavy Duty Paper Cars can be a fun and creative way to entertain children and add a touch of whimsy to any party or event. They can be used as decorations on tables or as part of a centerpiece, and can be filled with small toys or candy to serve as a party favor or gift. With their sturdy construction and customizable design, Heavy Duty Paper Cars are a popular choice for parents, party planners, and craft enthusiasts alike.",
            "quantity": 33,
            "price": 235000,
            "sold": 15,
            "inventory": 99,
            "type": "cake",
            "weight" : 1.52,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/vlt2.webp"
        },
        {
            "name": "Rustic Wooden Coat",
            "detail": "A Rustic Wooden Coat is not a specific type of dessert or food item, but rather a description of a coat rack or hanger that is made from wood and has a rustic or natural appearance. This type of coat rack is often used as a decorative and functional item in homes, offices, or other interior spaces.  Rustic Wooden Coats are typically made from solid wood or reclaimed wood, and may be designed with natural imperfections or irregularities that give them a rustic or vintage look. The wood may be left in its natural state, or it may be stained, painted, or distressed to achieve a desired effect.  These coat racks come in a variety of different styles and sizes, from simple wall-mounted hooks to freestanding racks with multiple arms or branches. They may be designed with additional features such as shelves, drawers, or mirrors, to provide added functionality or storage.  Rustic Wooden Coats can be a stylish and practical way to organize and display clothing, hats, bags, or other accessories. They can be used in a variety of different settings, from entryways and mudrooms to bedrooms, offices, or dressing rooms. With their natural beauty and durability, Rustic Wooden Coats are a popular choice for those who appreciate the warmth and character of natural materials.",
            "quantity": 33,
            "price": 455000,
            "sold": 15,
            "inventory": 99,
            "type": "cake",
            "weight" : 1.55,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/vlt3.webp"
        },
        {
            "name": "Fantastic Plastic Watch",
            "detail": "A Fantastic Plastic Watch is not a type of dessert or food item, but rather a type of wristwatch that is made from plastic and has a unique or stylish design. These watches are often considered fashionable accessories that can be worn by both men and women.  Fantastic Plastic Watches are typically made from high-quality plastic materials that are lightweight, durable, and easy to clean. They may be designed with a variety of different features, such as a digital or analog display, stopwatch, timer, or alarm.  These watches come in a wide range of colors and styles, from bright and bold to understated and classic. They may be designed with unique patterns, graphics, or textures, and may be embellished with rhinestones, jewels, or other decorative elements.  Fantastic Plastic Watches can be a fun and stylish way to add a pop of color or personality to any outfit. They can be worn on their own as a statement piece, or paired with other accessories such as bracelets or necklaces. With their affordable price point and wide range of styles, Fantastic Plastic Watches are a popular choice for those who want to stay on-trend without breaking the bank.",
            "quantity": 33,
            "price": 300000,
            "sold": 56,
            "inventory": 22,
            "type": "cake",
            "weight" : 0.9,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/vlt4.webp"
        },
        {
            "name": "Incredible Cotton Shirt",
            "detail": "An Incredible Cotton Shirt is not a type of dessert or food item, but rather a type of clothing item that is made from high-quality cotton and has a unique or exceptional design. These shirts are often considered fashionable and versatile pieces that can be worn by both men and women in a variety of settings.  Incredible Cotton Shirts are typically made from high-quality, soft and breathable cotton materials that are comfortable to wear and easy to care for. They may be designed with a variety of different features, such as a collar, button-front or pullover style, long or short sleeves, or pockets.  These shirts come in a wide range of colors and styles, from casual and relaxed to more formal and dressy. They may be designed with unique patterns, graphics, or prints, and may be embellished with embroidery, applique, or other decorative elements.  Incredible Cotton Shirts can be a versatile and stylish way to add a touch of personality and comfort to any outfit. They can be worn on their own with jeans or shorts for a casual look, or paired with dress pants or skirts for a more formal occasion. With their quality construction and unique design, Incredible Cotton Shirts are a popular choice for those who want to make a statement with their clothing.",
            "quantity": 33,
            "price": 270000,
            "sold": 44,
            "inventory": 48,
            "type": "cake",
            "weight" : 0.77,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/vlt5.webp"
        },
        {
            "name": "Lightweight Wool Keyboard",
            "detail": "A Lightweight Wool Keyboard is not a type of dessert or food item, but rather a type of computer keyboard that is made from wool and is designed to be lightweight and portable. These keyboards are often considered an eco-friendly and sustainable alternative to traditional plastic keyboards.  Lightweight Wool Keyboards are typically made from natural wool fibers that are soft, durable, and biodegradable. They may be designed with a variety of different features, such as a standard layout, wireless connectivity, and backlit keys for use in low-light conditions.  These keyboards come in a range of colors and styles, from minimalist and modern to more decorative and colorful. They may be designed to fit a variety of different devices, including laptops, tablets, and smartphones.  Lightweight Wool Keyboards can be a practical and eco-friendly way to type on-the-go or at home. They are easy to pack and transport, and can be a comfortable alternative to hard plastic keyboards. With their unique design and sustainable materials, Lightweight Wool Keyboards are a popular choice for those who prioritize both function and sustainability in their technology products.",
            "quantity": 33,
            "price": 419000,
            "sold": 9,
            "inventory": 74,
            "type": "cake",
            "weight" : 0.39,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/frame_2.webp"
        },
        {
            "name": "Chocolate cupcake",
            "detail": "A chocolate cupcake is a small, individual-sized cake that is made from chocolate batter and topped with frosting or other sweet decorations. Chocolate cupcakes are a popular dessert that can be enjoyed at a variety of occasions, from birthday parties to weddings to everyday treats.  Chocolate cupcake batter is typically made from a mixture of flour, sugar, cocoa powder, baking powder, baking soda, salt, eggs, milk, and oil or butter. The batter is poured into cupcake liners and baked in a muffin tin in the oven. Once the cupcakes are fully baked, they can be removed from the oven and allowed to cool before being frosted or decorated.  Chocolate cupcakes can be topped with a variety of frostings or decorations, depending on personal preference. Common toppings include buttercream frosting, chocolate ganache, whipped cream, sprinkles, and chocolate chips. Some chocolate cupcakes may also be filled with a chocolate ganache or other sweet filling to add an extra layer of flavor.  Chocolate cupcakes are a classic dessert that are beloved by many for their rich chocolate flavor and bite-sized portions. They can be a fun and festive addition to any celebration, or a satisfying treat to enjoy at home.",
            "quantity": 33,
            "price": 29900,
            "sold": 5,
            "inventory": 5,
            "type": "cake",
            "weight" : 0.3,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/cc3-removebg-preview.png"
        },
        {
            "name": "Vanilla cupcake",
            "detail": "A vanilla cupcake is a small, individual-sized cake that is made from vanilla batter and topped with frosting or other sweet decorations. Vanilla cupcakes are a popular dessert that can be enjoyed at a variety of occasions, from birthday parties to weddings to everyday treats.  Vanilla cupcake batter is typically made from a mixture of flour, sugar, baking powder, baking soda, salt, eggs, milk, and vanilla extract. The batter is poured into cupcake liners and baked in a muffin tin in the oven. Once the cupcakes are fully baked, they can be removed from the oven and allowed to cool before being frosted or decorated.  Vanilla cupcakes can be topped with a variety of frostings or decorations, depending on personal preference. Common toppings include buttercream frosting, cream cheese frosting, fruit compote, sprinkles, and chocolate chips. Some vanilla cupcakes may also be filled with a sweet filling such as jam, lemon curd, or pastry cream to add an extra layer of flavor.  Vanilla cupcakes are a classic dessert that are beloved by many for their simple yet delicious flavor. They can be a fun and versatile addition to any celebration, or a satisfying treat to enjoy at home.",
            "quantity": 33,
            "price": 24900,
            "sold": 3,
            "inventory": 12,
            "type": "cake",
            "weight" : 0.81,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/cc1-removebg-preview.png"
        },
        {
            "name": "Strawberry cupcake",
            "detail": "A strawberry cupcake is a small, individual-sized cake that is made from strawberry-flavored batter and topped with frosting or other sweet decorations. Strawberry cupcakes are a popular dessert that can be enjoyed at a variety of occasions, from birthdays to weddings to everyday treats.  Strawberry cupcake batter is typically made from a mixture of flour, sugar, baking powder, baking soda, salt, eggs, milk, and strawberry puree. The batter is poured into cupcake liners and baked in a muffin tin in the oven. Once the cupcakes are fully baked, they can be removed from the oven and allowed to cool before being frosted or decorated.  Strawberry cupcakes can be topped with a variety of frostings or decorations, depending on personal preference. Common toppings include strawberry buttercream frosting, cream cheese frosting with chopped strawberries, whipped cream, fresh strawberries, and sprinkles. Some strawberry cupcakes may also be filled with a strawberry jam or pastry cream to add an extra layer of flavor.  Strawberry cupcakes are a sweet and fruity dessert that are perfect for spring and summer celebrations. They can be a fun and colorful addition to any party, or a delicious treat to enjoy at home.",
            "quantity": 33,
            "price": 34900,
            "sold": 2,
            "inventory": 10,
            "type": "cake",
            "weight" : 1.75,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/cc2-removebg-preview.png"
        },
        {
            "name": "Red Velvet cupcake",
            "detail": "A red velvet cupcake is a small, individual-sized cake that is made from a distinctive red-colored chocolate batter and topped with cream cheese frosting. Red velvet cupcakes are a popular dessert that can be enjoyed at a variety of occasions, from weddings to Valentine's Day to everyday treats.  Red velvet cupcake batter is typically made from a mixture of flour, cocoa powder, sugar, baking powder, baking soda, salt, eggs, oil, buttermilk, and red food coloring. The batter is poured into cupcake liners and baked in a muffin tin in the oven. Once the cupcakes are fully baked, they can be removed from the oven and allowed to cool before being frosted with cream cheese frosting.  Cream cheese frosting is the traditional topping for red velvet cupcakes and is made from a mixture of cream cheese, butter, powdered sugar, and vanilla extract. The frosting is typically piped onto the cupcakes using a pastry bag to create a swirl or other decorative design.  Red velvet cupcakes are a classic dessert that are beloved by many for their unique flavor and striking appearance. They can be a fun and festive addition to any celebration, or a delicious treat to enjoy on their own.",
            "quantity": 33,
            "price": 39900,
            "sold": 1,
            "inventory": 7,
            "type": "cake",
            "weight" : 1.53,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/cc4-removebg-preview.png"
        },
        {
            "name": "Carrot cupcake",
            "detail": "",
            "quantity": 33,
            "price": 21900,
            "sold": 4,
            "inventory": 16,
            "type": "cake",
            "weight" : 0.75,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/cc7-removebg-preview.png"
        },
        {
            "name": "Cupcakes tout framboise",
            "detail": "",
            "quantity": 33,
            "price": 33000,
            "sold": 12,
            "inventory": 23,
            "type": "cake",
            "weight" : 0.69,
            "images": "https://raw.githubusercontent.com/nguyenvancuong1ty/imagas/main/cc6-removebg-preview.png"
        },
        {
            "name": "Candy Bar",
            "detail": "Candy Bar is a delightful treat that is enjoyed by candy enthusiasts of all ages. It features a combination of sweet flavors and textures, making it an irresistible choice. This candy bar is made with a blend of caramel, nougat, and peanuts, all coated in rich milk chocolate. Each bite offers a perfect balance of chewiness and crunchiness.",
            "quantity": 25,
            "price": 1500,
            "sold": 15,
            "inventory": 60,
            "type": "candy",
            "images": "https://www.twix.com/cdn-cgi/image/width=600,height=600,f=auto,quality=90/sites/g/files/fnmzdf236/files/migrate-product-files/pm57alsea7mspqhhgfuf.png",
            "weight": 0.05
        },
        {
            "name": "Gummy Bears",
            "detail": "Gummy Bears are a classic candy loved by kids and adults alike. These chewy and colorful treats are made with gelatin, sugar, and fruit flavors. They come in various shapes such as bears, worms, and other fun characters. Gummy Bears are perfect for snacking, sharing, or adding a playful touch to desserts.",
            "quantity": 40,
            "price": 800,
            "sold": 30,
            "inventory": 100,
            "type": "candy",
            "images": "https://cdn11.bigcommerce.com/s-riqk6cih6h/images/stencil/1280x1280/products/525/2169/albananese-ultimate-bears-grouping__41721.1676582162.png?c=1",
            "weight": 0.1
        },
        {
            "name": "Sour Patch Kids",
            "detail": "Sour Patch Kids are a tangy and sour candy that packs a flavorful punch. These bite-sized candies have a unique combination of sour and sweet taste, making them a popular choice among candy lovers. Sour Patch Kids come in various fruit flavors, including lemon, lime, orange, and cherry. They are perfect for those who enjoy a little zing in their candy.",
            "quantity": 35,
            "price": 1200,
            "sold": 25,
            "inventory": 80,
            "type": "candy",
            "images": "https://m.media-amazon.com/images/I/81SFEy-bzlL.jpg",
            "weight": 0.08
        },
        {
            "name": "Jelly Beans",
            "detail": "Jelly Beans are small bean-shaped candies with a soft and chewy texture. These colorful treats come in a wide range of flavors, including fruity, sour, and even novelty flavors. Jelly Beans are often enjoyed during holidays like Easter but are loved all year round. They are a favorite choice for candy jars, party favors, and snacking.",
            "quantity": 50,
            "price": 1000,
            "sold": 40,
            "inventory": 120,
            "type": "candy",
            "images": "https://nationaltoday.com/wp-content/uploads/2022/05/9-Jelly-Beans.jpg",
            "weight": 0.03
        },
        {
            "name": "Cotton Candy",
            "detail": "Cotton Candy is a fluffy and sugary confection that brings back nostalgic memories of carnivals and fairs. This sweet treat is made by heating and liquefying sugar, then spinning it out through tiny holes where it solidifies in midair and is collected on a cone or stick. Cotton Candy melts in your mouth and dissolves into delightful sugary goodness.",
            "quantity": 30,
            "price": 1800,
            "sold": 20,
            "inventory": 70,
            "type": "candy",
            "images": "https://m.media-amazon.com/images/I/51wPjzdwA9L._AC_UF1000,1000_QL80_.jpg",
            "weight": 0.1
        },
        {
            "name": "Licorice",
            "detail": "Licorice is a chewy and flavorful candy that has been enjoyed for generations. It has a distinctive taste derived from the extract of the licorice plant root. Licorice candies come in various shapes and sizes, including ropes, twists, and bites. They are available in both sweet and salty flavors, catering to different preferences.",
            "quantity": 20,
            "price": 2000,
            "sold": 10,
            "inventory": 40,
            "type": "candy",
            "images": "https://cdn.shopify.com/s/files/1/0275/6984/8381/products/Untitled-1_0001_Layer1.jpg?v=1667436517",
            "weight": 0.05
        },
        {
            "name": "Rock Candy",
            "detail": "Rock Candy is a crystallized sugar confectionery that is visually stunning and delightful to eat. It is made by dissolving sugar in water and allowing it to crystallize over time. The resulting crystals form beautiful, sparkly structures on a stick. Rock Candy comes in various colors and flavors, making it a fun and decorative treat.",
            "quantity": 15,
            "price": 2500,
            "sold": 5,
            "inventory": 30,
            "type": "candy",
            "images": "https://www.persnicketyplates.com/wp-content/uploads/2021/02/homemade-rock-candy-SQUARE.jpg",
            "weight": 0.08
        },
        {
            "name": "Toffee",
            "detail": "Toffee is a buttery and crunchy candy that is loved for its rich caramel flavor. It is made by caramelizing sugar and butter, resulting in a sweet and toasty treat. Toffee can be enjoyed on its own or used as an ingredient in various desserts and baked goods. Its irresistible taste and texture make it a popular choice among candy enthusiasts.",
            "quantity": 25,
            "price": 1800,
            "sold": 15,
            "inventory": 60,
            "type": "candy",
            "images": "https://frostingandglue.com/wp-content/uploads/2021/05/process-Toffee-recipe-6-scaled-720x720.jpg",
            "weight": 0.1
        },
        {
            "name": "Jawbreakers",
            "detail": "Jawbreakers, also known as gobstoppers, are hard and long-lasting candies that are meant to be savored slowly. These multi-layered candies are designed to dissolve gradually, revealing different colors and flavors as you enjoy them. Jawbreakers come in various sizes, ranging from small to extra-large, providing a lasting and flavorful experience.",
            "quantity": 40,
            "price": 1200,
            "sold": 30,
            "inventory": 100,
            "type": "candy",
            "images": "https://cdn.shopify.com/s/files/1/0280/2765/0135/products/Strawberry_Jawbreaker_4_Pack_0be38f14-eb21-48a4-a985-963b799140f8_x722@2x.png?v=1657116017",
            "weight": 0.05
        },
        {
            "name": "Mints",
            "detail": "Mints are refreshing and minty candies that offer a burst of coolness to freshen up your breath. These small, hard candies come in various flavors, including peppermint, spearmint, and wintergreen. Mints are often enjoyed after meals or as a quick pick-me-up throughout the day. They are a staple in candy dishes and mint lovers' pockets.",
            "quantity": 35,
            "price": 1000,
            "sold": 25,
            "inventory": 80,
            "type": "candy",
            "images": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Scotch_mints.JPG",
            "weight": 0.03
        },
        {
            "name": "Kitchen Knife Set",
            "detail": "The Kitchen Knife Set is a must-have for any cooking enthusiast. This set includes a variety of high-quality knives that are essential for different kitchen tasks. The blades are made from stainless steel, ensuring durability and precision. With this knife set, you can effortlessly chop, slice, and dice your ingredients with ease.",
            "quantity": 20,
            "price": 50000,
            "sold": 15,
            "inventory": 30,
            "type": "houseware",
            "images": "https://m.media-amazon.com/images/I/718iZVcnVEL.jpg",
            "weight": 1.2
        },
        {
            "name": "Non-Stick Cookware Set",
            "detail": "The Non-Stick Cookware Set is a versatile and practical addition to any kitchen. This set includes a variety of pots and pans with a non-stick coating, making cooking and cleaning a breeze. The cookware is made from durable materials and features heat-resistant handles for safe and comfortable use. With this set, you can enjoy hassle-free cooking and delicious meals.",
            "quantity": 15,
            "price": 80000,
            "sold": 10,
            "inventory": 25,
            "type": "houseware",
            "images": "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1573838684-510OT01sdjL.jpg?crop=1xw:1.00xh;center,top&resize=980:*",
            "weight": 4.5
        },
        {
            "name": "Stainless Steel Flatware Set",
            "detail": "The Stainless Steel Flatware Set is a timeless and elegant addition to your dining table. This set includes forks, knives, and spoons, all made from high-quality stainless steel for durability and a polished look. The flatware features a classic design that complements any table setting, whether for everyday meals or special occasions.",
            "quantity": 30,
            "price": 40000,
            "sold": 20,
            "inventory": 40,
            "type": "houseware",
            "images": "https://m.media-amazon.com/images/I/71YP1-EuaPL.jpg",
            "weight": 1.8
        },
        {
            "name": "Glass Drinkware Set",
            "detail": "The Glass Drinkware Set is perfect for serving your favorite beverages in style. This set includes a collection of glasses made from high-quality glass, ensuring clarity and durability. Whether you're enjoying a refreshing drink or hosting a gathering, these glasses add an elegant touch to any occasion.",
            "quantity": 25,
            "price": 35000,
            "sold": 18,
            "inventory": 35,
            "type": "houseware",
            "images": "https://i5.walmartimages.com/asr/4b03d8bd-4a60-410a-b46b-41f75e4c8a94.76bb6ed691e1111edfa78a3e108d170a.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
            "weight": 2.2
        },
        {
            "name": "Electric Kettle",
            "detail": "The Electric Kettle is a convenient and efficient appliance for boiling water. With its sleek design and fast heating capabilities, you can quickly prepare hot water for tea, coffee, or other hot beverages. The kettle features automatic shut-off and boil-dry protection for safety. It is a must-have for any kitchen or office space.",
            "quantity": 40,
            "price": 60000,
            "sold": 25,
            "inventory": 45,
            "type": "houseware",
            "images": "https://product.hstatic.net/200000492221/product/am_sieu_toc__2__ad3d73870973450d87b4620a217645ee_master.jpg",
            "weight": 1.5
        },
        {
            "name": "Ceramic Dinnerware Set",
            "detail": "The Ceramic Dinnerware Set is a stylish and durable option for your dining needs. This set includes dinner plates, salad plates, bowls, and mugs, all made from high-quality ceramic. The pieces feature a modern design and are microwave and dishwasher safe. Elevate your dining experience with this elegant dinnerware set.",
            "quantity": 20,
            "price": 70000,
            "sold": 12,
            "inventory": 30,
            "type": "houseware",
            "images": "https://assets.weimgs.com/weimgs/rk/images/wcm/products/202303/0055/coupe-stoneware-dinnerware-set-of-24-c.jpg",
            "weight": 5.0
        },
        {
            "name": "Silicone Baking Mat",
            "detail": "The Silicone Baking Mat is a versatile tool for baking enthusiasts. This mat provides a non-stick surface for baking cookies, pastries, and more, without the need for greasing or parchment paper. It is made from food-grade silicone and can withstand high temperatures. With this baking mat, you can enjoy hassle-free baking and easy cleanup.",
            "quantity": 35,
            "price": 15000,
            "sold": 28,
            "inventory": 40,
            "type": "houseware",
            "images": "https://static.onecms.io/wp-content/uploads/sites/19/2015/10/21/silpat-baking-mat-mr.jpg",
            "weight": 0.3
        },
        {
            "name": "Kitchen Storage Containers",
            "detail": "The Kitchen Storage Containers are essential for keeping your pantry organized. This set includes a variety of containers in different sizes, perfect for storing dry ingredients, snacks, and leftovers. The containers are made from BPA-free plastic and feature airtight lids to keep your food fresh. Say goodbye to messy cabinets with these convenient storage solutions.",
            "quantity": 30,
            "price": 25000,
            "sold": 20,
            "inventory": 35,
            "type": "houseware",
            "images": "https://m.media-amazon.com/images/I/911tl4JlRIL._AC_UF894,1000_QL80_.jpg",
            "weight": 1.0
        },
        {
            "name": "Bathroom Towel Set",
            "detail": "The Bathroom Towel Set is a luxurious addition to your bath routine. This set includes bath towels, hand towels, and washcloths, all made from soft and absorbent cotton. The towels feature a plush texture and are designed to provide maximum comfort and durability. Elevate your bathroom experience with these high-quality towels.",
            "quantity": 25,
            "price": 45000,
            "sold": 18,
            "inventory": 30,
            "type": "houseware",
            "images": "https://secure.img1-cg.wfcdn.com/im/12123277/resize-h600-w600%5Ecompr-r85/3004/30044351/Bath+Towel+Sets.jpg",
            "weight": 2.5
        },
        {
            "name": "Stainless Steel Trash Can",
            "detail": "The Stainless Steel Trash Can is a sleek and functional addition to any room. This trash can is made from durable stainless steel and features a foot pedal for hands-free operation. It has a removable inner bucket for easy cleaning and odor control. With its modern design and practicality, this trash can is perfect for kitchens, bathrooms, or offices.",
            "quantity": 20,
            "price": 35000,
            "sold": 15,
            "inventory": 25,
            "type": "houseware",
            "images": "https://mobileimages.lowes.com/productimages/dbac3c1e-5f17-4a65-b3f8-11f7dbc5c13d/47730403.jpg",
            "weight": 3.0
        },
        {
            "name": "Smartphone",
            "detail": "The Smartphone is an essential electronic device that keeps you connected and organized. This device features a high-resolution display, powerful processor, and advanced camera capabilities. With a smartphone, you can make calls, send messages, browse the internet, take photos, and access a wide range of apps for productivity, entertainment, and communication.",
            "quantity": 50,
            "price": 1000000,
            "sold": 45,
            "inventory": 55,
            "type": "electronic device",
            "images": "https://cdn-amz.woka.io/images/I/61X+PJnaq5L.jpg",
            "weight": 0.2
        },
        {
            "name": "Laptop",
            "detail": "The Laptop is a portable and versatile electronic device that is essential for work, study, and entertainment. This device features a high-resolution display, fast processor, ample storage, and various connectivity options. With a laptop, you can browse the internet, create documents, watch movies, play games, and perform a wide range of tasks on the go.",
            "quantity": 40,
            "price": 2000000,
            "sold": 35,
            "inventory": 45,
            "type": "electronic device",
            "images": "https://hanoicomputercdn.com/media/product/68198_laptop_lenovo_ideapad_slim_5_pro_37.png",
            "weight": 1.5
        },
        {
            "name": "Smart TV",
            "detail": "The Smart TV is a cutting-edge electronic device that brings entertainment to the next level. This TV features a high-definition display, smart capabilities, and access to various streaming platforms. With a smart TV, you can enjoy your favorite movies, TV shows, and online content with stunning visuals and immersive sound.",
            "quantity": 30,
            "price": 3000000,
            "sold": 25,
            "inventory": 35,
            "type": "electronic device",
            "images": "https://bizweb.dktcdn.net/thumb/1024x1024/100/441/580/products/thiet-ke-chua-co-ten-21.png?v=1677486416417",
            "weight": 20.0
        },
        {
            "name": "Wireless Headphones",
            "detail": "Wireless Headphones are a convenient and immersive way to enjoy your favorite audio content. These headphones connect to your devices via Bluetooth, offering freedom of movement without the hassle of tangled wires. They provide high-quality sound and feature noise-cancellation technology for an enhanced listening experience.",
            "quantity": 35,
            "price": 500000,
            "sold": 30,
            "inventory": 40,
            "type": "electronic device",
            "images": "https://m.media-amazon.com/images/I/61-g7m+90eL.jpg",
            "weight": 0.3
        },
        {
            "name": "Digital Camera",
            "detail": "The Digital Camera is a versatile electronic device that allows you to capture and preserve your precious moments. This camera features a high-resolution sensor, optical zoom, and various shooting modes. It enables you to take stunning photos and record videos with clarity and detail. With a digital camera, you can unleash your creativity and document life's memorable events.",
            "quantity": 25,
            "price": 1500000,
            "sold": 20,
            "inventory": 30,
            "type": "electronic device",
            "images": "https://cdn-amz.woka.io/images/I/71JDnICC3nL.jpg",
            "weight": 0.5
        },
        {
            "name": "Bluetooth Speaker",
            "detail": "The Bluetooth Speaker is a portable and wireless audio device that allows you to enjoy your favorite music anytime, anywhere. This speaker connects to your devices via Bluetooth, offering seamless playback without the need for cables. It delivers clear and powerful sound, making it perfect for parties, outdoor activities, or simply enhancing your listening experience.",
            "quantity": 40,
            "price": 800000,
            "sold": 35,
            "inventory": 45,
            "type": "electronic device",
            "images": "https://www.realsimple.com/thmb/DNtKv8dyFUvUqwPKruxAXVQO4Yo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/jbl-flip-6-portable-waterproof-speaker-e1a24df1c00f4212b35f5894c42b9c7f.jpg",
            "weight": 0.8
        },
        {
            "name": "Fitness Tracker",
            "detail": "The Fitness Tracker is a wearable electronic device that helps you monitor and track your fitness activities. This device features a built-in heart rate monitor, step counter, sleep tracker, and various other health-related sensors. It syncs with your smartphone, allowing you to analyze your fitness data, set goals, and stay motivated on your fitness journey.",
            "quantity": 30,
            "price": 600000,
            "sold": 25,
            "inventory": 35,
            "type": "electronic device",
            "images": "https://cdn.vox-cdn.com/thumbor/MshSJ5rL-aUJkEk4dnATU1Hu2Ng=/0x0:2040x1360/1400x1400/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23336503/acastro_220321_5092_0001.jpg",
            "weight": 0.1
        },
        {
            "name": "Tablet",
            "detail": "The Tablet is a portable and versatile electronic device that offers a larger screen than a smartphone and greater portability than a laptop. This device features a high-resolution display, fast processor, ample storage, and a range of apps for productivity, entertainment, and creativity. With a tablet, you can browse the internet, read e-books, watch videos, play games, and much more.",
            "quantity": 35,
            "price": 1500000,
            "sold": 30,
            "inventory": 40,
            "type": "electronic device",
            "images": "https://cdn.tgdd.vn/Products/Images/522/294103/iPad-gen-10-1-600x600.jpg",
            "weight": 0.7
        },
        {
            "name": "Portable Power Bank",
            "detail": "The Portable Power Bank is a compact and handy electronic device that keeps your devices charged on the go. This power bank features a high-capacity battery and multiple charging ports, allowing you to charge your smartphone, tablet, or other USB-powered devices anytime, anywhere. With a portable power bank, you can stay connected without worrying about battery life.",
            "quantity": 40,
            "price": 200000,
            "sold": 35,
            "inventory": 45,
            "type": "electronic device",
            "images": "https://cdn-amz.woka.io/images/I/51lBsi0W9uL.jpg",
            "weight": 0.3
        },
        {
            "name": "Smart Watch",
            "detail": "The Smart Watch is a wearable electronic device that offers a range of features beyond just telling time. This watch connects to your smartphone, providing notifications, fitness tracking, music control, and more on your wrist. It is a convenient and stylish accessory that helps you stay connected and monitor your health and fitness goals.",
            "quantity": 30,
            "price": 900000,
            "sold": 25,
            "inventory": 35,
            "type": "electronic device",
            "images": "https://play-lh.googleusercontent.com/v8pfl0I1XqHyrTM1dqOEGoCdurCAwME8LBGVqZUy9FlCIRmnBt_ObEwvqb568jR4B0A",
            "weight": 0.2
        },
        {
            "name": "T-Shirt",
            "detail": "The T-Shirt is a versatile and comfortable piece of clothing that is perfect for casual wear. This t-shirt is made from soft and breathable fabric, ensuring comfort throughout the day. It features a classic design with a round neckline and short sleeves. Pair it with jeans or shorts for a relaxed and stylish look.",
            "quantity": 50,
            "price": 200000,
            "sold": 45,
            "inventory": 55,
            "type": "clothes",
            "images": "https://image.uniqlo.com/UQ/ST3/AsianCommon/imagesgoods/422992/sub/goods_422992_sub14.jpg?width=494",
            "weight": 0.2
        },
        {
            "name": "Jeans",
            "detail": "Jeans are a timeless and versatile clothing item that can be dressed up or down for various occasions. These jeans are made from high-quality denim fabric, ensuring durability and a comfortable fit. They feature a classic straight leg design with a mid-rise waist. Pair them with a t-shirt for a casual look or dress them up with a blouse for a more polished ensemble.",
            "quantity": 40,
            "price": 500000,
            "sold": 35,
            "inventory": 45,
            "type": "clothes",
            "images": "https://tarmor.vn/wp-content/uploads/2020/07/skinny-jeans-light-blue.png",
            "weight": 0.8
        },
        {
            "name": "Dress Shirt",
            "detail": "The Dress Shirt is a stylish and sophisticated option for formal or business attire. This shirt is made from high-quality fabric, ensuring a crisp and polished look. It features a button-up design with a classic collar and long sleeves. Pair it with dress pants or a skirt for a professional and elegant outfit.",
            "quantity": 30,
            "price": 600000,
            "sold": 25,
            "inventory": 35,
            "type": "clothes",
            "images": "https://image.josbank.com/is/image/JosBank/5JLK_10_TRAVELER_WHITE_NEW_MAIN?$pgp_desktop_thumbnail_lg$",
            "weight": 0.4
        },
        {
            "name": "Sweater",
            "detail": "The Sweater is a cozy and fashionable piece of clothing that is perfect for cooler weather. This sweater is made from soft and warm knit fabric, ensuring comfort and insulation. It features a crew neckline and long sleeves. Pair it with jeans or a skirt for a stylish and comfortable outfit during the colder months.",
            "quantity": 35,
            "price": 400000,
            "sold": 30,
            "inventory": 40,
            "type": "clothes",
            "images": "https://bizweb.dktcdn.net/100/348/395/products/ao-sweater-ni-form-rong-nam-nu-local-brand-xanh-la-nhat.jpg?v=1639454096483",
            "weight": 0.6
        },
        {
            "name": "Sneakers",
            "detail": "Sneakers are a practical and trendy footwear option for everyday wear. These sneakers are made from durable materials, ensuring longevity and comfort. They feature a lace-up design and a cushioned sole for support and impact absorption. Pair them with jeans, shorts, or dresses for a casual and sporty look.",
            "quantity": 40,
            "price": 800000,
            "sold": 35,
            "inventory": 45,
            "type": "clothes",
            "images": "https://assets.hermes.com/is/image/hermesproduct/quicker-sneaker--102190ZH09-worn-1-0-0-800-800_g.jpg",
            "weight": 0.9
        },
        {
            "name": "Summer Dress",
            "detail": "The Summer Dress is a breezy and feminine option for warm-weather occasions. This dress is made from lightweight and flowy fabric, ensuring comfort and ease of movement. It features a floral print and a flattering silhouette with adjustable straps. Pair it with sandals or wedges for a stylish and comfortable summer outfit.",
            "quantity": 30,
            "price": 700000,
            "sold": 25,
            "inventory": 35,
            "type": "clothes",
            "images": "https://edge.curalate.com/v1/img/g-qhGSqsYwrcTCP5fIYP9O4AhbIYEvEN4rbR_NBTLwM=/d/l",
            "weight": 0.3
        },
        {
            "name": "Hoodie",
            "detail": "The Hoodie is a casual and comfortable clothing item that is perfect for relaxed and cozy days. This hoodie is made from soft and warm fabric, ensuring comfort and insulation. It features a hood with adjustable drawstrings and a kangaroo pocket. Pair it with sweatpants or jeans for a laid-back and sporty look.",
            "quantity": 35,
            "price": 600000,
            "sold": 30,
            "inventory": 40,
            "type": "clothes",
            "images": "https://bizweb.dktcdn.net/100/415/697/products/z3665576642921-afc0cfca4f7393d4e01b36394aec71dd-1.jpg?v=1666586894860",
            "weight": 0.7
        },
        {
            "name": "Polo Shirt",
            "detail": "The Polo Shirt is a classic and versatile piece of clothing that offers a combination of comfort and style. This shirt is made from breathable fabric, ensuring comfort during warmer days. It features a button-up collar and short sleeves. Pair it with shorts or chinos for a smart-casual look.",
            "quantity": 40,
            "price": 300000,
            "sold": 35,
            "inventory": 45,
            "type": "clothes",
            "images": "https://mobile.yoox.com/images/items/12/12452962KC_14_f.jpg",
            "weight": 0.3
        },
        {
            "name": "Leather Jacket",
            "detail": "The Leather Jacket is a timeless and edgy outerwear option that adds a touch of attitude to any outfit. This jacket is made from high-quality leather, ensuring durability and style. It features a zip-up front, multiple pockets, and a sleek design. Pair it with jeans or a dress for a bold and fashionable look.",
            "quantity": 30,
            "price": 900000,
            "sold": 25,
            "inventory": 35,
            "type": "clothes",
            "images": "https://cdn.shopify.com/s/files/1/0419/1525/products/1024x1024-Mens-Jacket-Keanu-Black-110221-1.jpg?v=1636392243 ",
            "weight": 1.2
        },
        {
            "name": "Smart Speaker",
            "detail": "The Smart Speaker is a versatile smart device that combines the functionality of a speaker with voice-controlled smart features. This speaker is equipped with virtual assistants such as Amazon Alexa or Google Assistant, allowing you to control your smart home devices, play music, get weather updates, and more, all with voice commands. It provides high-quality sound and seamlessly integrates into your smart home ecosystem.",
            "quantity": 50,
            "price": 1500000,
            "sold": 45,
            "inventory": 55,
            "type": "smart device",
            "images": "https://media.gq-magazine.co.uk/photos/63eccf7d9b06869e196c6571/master/w_1920,h_1280,c_limit/SmartSpeaker_Apple-HomePod-2--.png.jpg",
            "weight": 0.5
        },
        {
            "name": "Smart Thermostat",
            "detail": "The Smart Thermostat is an intelligent device that allows you to control and monitor the temperature of your home remotely. This thermostat connects to your home's Wi-Fi network and can be accessed through a smartphone app. It enables you to set schedules, adjust temperature settings, and even learn your preferences over time to optimize energy efficiency. With a smart thermostat, you can save energy and create a comfortable environment in your home.",
            "quantity": 40,
            "price": 2000000,
            "sold": 35,
            "inventory": 45,
            "type": "smart device",
            "images": "https://cdn-amz.woka.io/images/I/61A+x8c9VeL.jpg",
            "weight": 0.3
        },
        {
            "name": "Smart Security Camera",
            "detail": "The Smart Security Camera is an advanced surveillance device that helps you keep an eye on your home or office. This camera connects to your Wi-Fi network and can be accessed through a smartphone app. It features high-resolution video recording, motion detection, and night vision capabilities. With a smart security camera, you can monitor your property remotely, receive alerts for suspicious activities, and ensure peace of mind.",
            "quantity": 30,
            "price": 2500000,
            "sold": 25,
            "inventory": 35,
            "type": "smart device",
            "images": "https://pyxis.nymag.com/v1/imgs/05a/0f9/a9ee08e94a61ab4b6a023fbc70c4efd55f-09-cam.rsquare.w700.jpg",
            "weight": 0.6
        },
        {
            "name": "Smart Doorbell",
            "detail": "The Smart Doorbell is a convenient and secure smart device that allows you to see, hear, and speak to visitors at your doorstep. This doorbell is equipped with a camera, microphone, and speaker, and connects to your home's Wi-Fi network. It sends notifications to your smartphone when someone rings the doorbell, and you can have a real-time video conversation with the visitor, even when you're not at home. With a smart doorbell, you can enhance the security and convenience of your home.",
            "quantity": 35,
            "price": 1800000,
            "sold": 30,
            "inventory": 40,
            "type": "smart device",
            "images": "https://cdn.thewirecutter.com/wp-content/media/2021/06/smartdoorbell-2048px-0756.jpg",
            "weight": 0.4
        },
        {
            "name": "Smart Lock",
            "detail": "The Smart Lock is a keyless entry system that provides enhanced security and convenience for your home. This lock replaces your traditional door lock and allows you to lock and unlock your door using a smartphone app or a keypad. It can also integrate with other smart home devices, enabling automation and remote access control. With a smart lock, you can monitor and control access to your home, and eliminate the need for physical keys.",
            "quantity": 40,
            "price": 1500000,
            "sold": 35,
            "inventory": 45,
            "type": "smart device",
            "images": "https://t2qwifi.com/wp-content/uploads/2020/12/smart-lock-la-gi-1-1.jpg",
            "weight": 0.8
        },
        {
            "name": "Smart TV",
            "detail": "The Smart TV is an advanced television that offers internet connectivity and a range of smart features. This TV allows you to stream content from popular platforms like Netflix, Hulu, and YouTube directly on the screen. It also supports voice commands, app downloads, and screen mirroring from your mobile devices. With a smart TV, you can enjoy a wide range of entertainment options and access online content with ease.",
            "quantity": 30,
            "price": 3000000,
            "sold": 25,
            "inventory": 35,
            "type": "smart device",
            "images": "https://cdn.mediamart.vn/images/product/smart-tivi-samsung-4k-55-inch-55au7002-uhd_3c2b251e.jpg",
            "weight": 10.5
        }
    ]
}
